Examinator/src/InformationRegisters/ОткрытоеОбучениеСУО/ОткрытоеОбучениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОткрытоеОбучениеСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляРуководителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытияЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗаявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ПрохожденияОбученияСУО/ПрохожденияОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрохожденияОбученияСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроцессаОбучения</name>
    <type>
      <types>EnumRef.СтатусыПроцессаОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Актуально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПрохождение</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Значимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещеноОбщениеМеждуУчастниками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеЭлектронногоРесурса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеМероприятия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ЗаявкиНаОбучениеСУО/ЗаявкиНаОбучениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаявкиНаОбучениеСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЗаявки</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
      <types>CatalogRef.КаталогПрограммОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредметЗаявки</name>
    <type>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ОткрытоеОбучениеСУО/ManagerModule.bsl
Функция ВыбратьЭлементыРасписания(ПроведениеОбучения=Неопределено, Пользователь=Неопределено, НачалоПериода=Неопределено, КонецПериода=Неопределено, ОткрытоДляРуководителей=Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос();

	Запрос.Текст = "ВЫБРАТЬ
	               |	ОткрытоеОбучение.Регистратор КАК ПроведениеОбучения,
	               |	ОткрытоеОбучение.ДатаНачалаПроведения,
	               |	ОткрытоеОбучение.ДатаОкончанияПроведения,
	               |	ПрохожденияОбучения.Регистратор КАК ПрохождениеОбучения,
	               |	ОткрытоеОбучение.ДатаОткрытияЗаписи,
	               |	ОткрытоеОбучение.ДатаЗакрытияЗаписи,
	               |	ОткрытоеОбучение.ТребуетсяЗаявка,
	               |	ВЫБОР
	               |		КОГДА ОткрытоеОбучение.ПроведениеОбучения.Наименование <> """"
	               |			ТОГДА ОткрытоеОбучение.ПроведениеОбучения.Наименование
	               |		КОГДА ОткрытоеОбучение.ПроведениеОбучения.НаОсновеЭлектронногоРесурса
	               |			ТОГДА ОткрытоеОбучение.ПроведениеОбучения.ЭлектронныйРесурс.Наименование
	               |		КОГДА ОткрытоеОбучение.ПроведениеОбучения.НаОсновеМероприятия
	               |			ТОГДА ОткрытоеОбучение.ПроведениеОбучения.Мероприятие.Наименование
	               |		ИНАЧЕ ""Обучение""
	               |	КОНЕЦ КАК Наименование,
	               |	ОткрытоеОбучение.ПроведениеОбучения.СкрытьВремяПроведения КАК СкрытьВремяПроведения,
	               |	ОткрытоеОбучение.Пользователь,
	               |	ЗаявкиНаОбучениеСУОСрезПоследних.Статус КАК СтатусЗаявки,
	               |	ЗаявкиНаОбучениеСУОСрезПоследних.Период КАК ДатаЗаявки,
	               |	ОткрытоеОбучение.ПроведениеОбучения.ФайлКартинки КАК ФайлКартинки,
	               |	ОткрытоеОбучение.ПроведениеОбучения.ФайлКартинки.Расширение КАК РасширениеКартинки
	               |ИЗ
	               |	РегистрСведений.ОткрытоеОбучениеСУО КАК ОткрытоеОбучение
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрохожденияОбученияСУО КАК ПрохожденияОбучения
	               |		ПО ОткрытоеОбучение.ПроведениеОбучения = ПрохожденияОбучения.ПроведениеОбучения
	               |			И ОткрытоеОбучение.Пользователь = ПрохожденияОбучения.Пользователь
	               |			И ОткрытоеОбучение.Сценарий = ПрохожденияОбучения.Сценарий
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаявкиНаОбучениеСУО.СрезПоследних(, ) КАК ЗаявкиНаОбучениеСУОСрезПоследних
	               |		ПО ОткрытоеОбучение.Пользователь = ЗаявкиНаОбучениеСУОСрезПоследних.Пользователь
	               |			И ОткрытоеОбучение.ПроведениеОбучения = ЗаявкиНаОбучениеСУОСрезПоследних.ПредметЗаявки
	               |ГДЕ
	               |	ОткрытоеОбучение.ОткрытоДляРуководителей = &ОткрытоДляРуководителей";
				   
	Запрос.Параметры.Вставить("ОткрытоДляРуководителей", ОткрытоДляРуководителей);			   
	
	Если ПроведениеОбучения <> Неопределено Тогда
		
		Запрос.Текст = 	Запрос.Текст + " И ОткрытоеОбучение.ПроведениеОбучения = &ПроведениеОбучения";
		
		Запрос.Параметры.Вставить("ПроведениеОбучения", ПроведениеОбучения);
		
	КонецЕсли;
	
	Если Пользователь <> Неопределено Тогда
		
		Запрос.Текст = 	Запрос.Текст + " И ОткрытоеОбучение.Пользователь В(&Пользователь)";
		
		Запрос.Параметры.Вставить("Пользователь", Пользователь);
		
	КонецЕсли;				   
				   
	Если НачалоПериода <> Неопределено И КонецПериода <> Неопределено Тогда
				   
		Запрос.Параметры.Вставить("НачалоПериода", НачалоПериода);
		Запрос.Параметры.Вставить("КонецПериода", КонецПериода);
		Запрос.Параметры.Вставить("ПустаяДата", Дата("00010101"));
				   
		Запрос.Текст = 	Запрос.Текст + "		   
	               |	И (ОткрытоеОбучение.ДатаНачалаПроведения МЕЖДУ &НачалоПериода И &КонецПериода
	               |			ИЛИ ОткрытоеОбучение.ДатаОкончанияПроведения МЕЖДУ &НачалоПериода И &КонецПериода
	               |			ИЛИ ОткрытоеОбучение.ДатаНачалаПроведения < &НачалоПериода
	               |				И ОткрытоеОбучение.ДатаОкончанияПроведения > &КонецПериода
	               |			ИЛИ ОткрытоеОбучение.ДатаНачалаПроведения = &ПустаяДата)";
					   
					   				   
		Результат = Запрос.Выполнить();

	КонецЕсли;

	Результат = Запрос.Выполнить();

	Возврат Результат.Выбрать();
	
КонецФункции
